byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/shMeshOrig/system/snappyHexMeshSrc/STLList
splittedChannel.stl
{
    type triSurfaceMesh;
    name splittedChannel;
}
splittedChannelWalls.stl
{
    type triSurfaceMesh;
    name splittedChannelWalls;
}
