byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/shMeshOrig/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    viscousLayerCellSet;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/splittedChannelWalls.stl";
            outsidePoints   ((1e11 1e11 1e11));         // definition of outside
            includeCut      false;                      // cells cut by surface
            includeInside   false;                      // cells not on outside of surf
            includeOutside  false;                      // cells on outside of surf
            nearDistance    2.0;                       // cells with centre near surf
//                                                      // (set to -1 if not used)
            curvature       -100;                       // and near surf curvature
//                                                      // (set to -100 if not used)
        }
    }
    {
        name        viscousLayerZone;
        type        cellZoneSet;
        action      new;
        source      setToCellZone;
        sourceInfo
        {
            set     viscousLayerCellSet;
        }
    }
);

// ************************************************************************* //
